MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32M140KA/mcu.h
typedef struct
{
    union
    {
        __IO uint8_t FN0;
        stc_gpio_fn0_field_t FN0_f;
    };
    uint8_t RESERVED1[3];
    union
    {
        __IO uint8_t FN1;
        stc_gpio_fn1_field_t FN1_f;
    };
    uint8_t RESERVED2[3];
    union
    {
        __IO uint8_t FN2;
        stc_gpio_fn2_field_t FN2_f;
    };
    uint8_t RESERVED3[3];
    union
    {
        __IO uint8_t FN3;
        stc_gpio_fn3_field_t FN3_f;
    };
    uint8_t RESERVED4[3];
    union
    {
        __IO uint8_t FN4;
        stc_gpio_fn4_field_t FN4_f;
    };
    uint8_t RESERVED5[3];
    union
    {
        __IO uint8_t FN5;
        stc_gpio_fn5_field_t FN5_f;
    };
    uint8_t RESERVED6[3];
    union
    {
        __IO uint8_t FN6;
        stc_gpio_fn6_field_t FN6_f;
    };
    uint8_t RESERVED7[3];
    union
    {
        __IO uint8_t FN7;
        stc_gpio_fn7_field_t FN7_f;
    };
    uint8_t RESERVED8[227];
    union
    {
        __IO uint8_t PU0;
        stc_gpio_pu0_field_t PU0_f;
    };
    uint8_t RESERVED9[3];
    union
    {
        __IO uint8_t PU1;
        stc_gpio_pu1_field_t PU1_f;
    };
    uint8_t RESERVED10[3];
    union
    {
        __IO uint8_t PU2;
        stc_gpio_pu2_field_t PU2_f;
    };
    uint8_t RESERVED11[3];
    union
    {
        __IO uint8_t PU3;
        stc_gpio_pu3_field_t PU3_f;
    };
    uint8_t RESERVED12[3];
    union
    {
        __IO uint8_t PU4;
        stc_gpio_pu4_field_t PU4_f;
    };
    uint8_t RESERVED13[3];
    union
    {
        __IO uint8_t PU5;
        stc_gpio_pu5_field_t PU5_f;
    };
    uint8_t RESERVED14[3];
    union
    {
        __IO uint8_t PU6;
        stc_gpio_pu6_field_t PU6_f;
    };
    uint8_t RESERVED15[3];
    union
    {
        __IO uint8_t PU7;
        stc_gpio_pu7_field_t PU7_f;
    };
    uint8_t RESERVED16[227];
    union
    {
        __IO uint8_t DIR0;
        stc_gpio_dir0_field_t DIR0_f;
    };
    uint8_t RESERVED17[3];
    union
    {
        __IO uint8_t DIR1;
        stc_gpio_dir1_field_t DIR1_f;
    };
    uint8_t RESERVED18[3];
    union
    {
        __IO uint8_t DIR2;
        stc_gpio_dir2_field_t DIR2_f;
    };
    uint8_t RESERVED19[3];
    union
    {
        __IO uint8_t DIR3;
        stc_gpio_dir3_field_t DIR3_f;
    };
    uint8_t RESERVED20[3];
    union
    {
        __IO uint8_t DIR4;
        stc_gpio_dir4_field_t DIR4_f;
    };
    uint8_t RESERVED21[3];
    union
    {
        __IO uint8_t DIR5;
        stc_gpio_dir5_field_t DIR5_f;
    };
    uint8_t RESERVED22[3];
    union
    {
        __IO uint8_t DIR6;
        stc_gpio_dir6_field_t DIR6_f;
    };
    uint8_t RESERVED23[3];
    union
    {
        __IO uint8_t DIR7;
        stc_gpio_dir7_field_t DIR7_f;
    };
    uint8_t RESERVED24[227];
    union
    {
        __IO uint8_t GET0;
        stc_gpio_get0_field_t GET0_f;
    };
    uint8_t RESERVED25[3];
    union
    {
        __IO uint8_t GET1;
        stc_gpio_get1_field_t GET1_f;
    };
    uint8_t RESERVED26[3];
    union
    {
        __IO uint8_t GET2;
        stc_gpio_get2_field_t GET2_f;
    };
    uint8_t RESERVED27[3];
    union
    {
        __IO uint8_t GET3;
        stc_gpio_get3_field_t GET3_f;
    };
    uint8_t RESERVED28[3];
    union
    {
        __IO uint8_t GET4;
        stc_gpio_get4_field_t GET4_f;
    };
    uint8_t RESERVED29[3];
    union
    {
        __IO uint8_t GET5;
        stc_gpio_get5_field_t GET5_f;
    };
    uint8_t RESERVED30[3];
    union
    {
        __IO uint8_t GET6;
        stc_gpio_get6_field_t GET6_f;
    };
    uint8_t RESERVED31[3];
    union
    {
        __IO uint8_t GET7;
        stc_gpio_get7_field_t GET7_f;
    };
    uint8_t RESERVED32[227];
    union
    {
        __IO uint8_t SET0;
        stc_gpio_set0_field_t SET0_f;
    };
    uint8_t RESERVED33[3];
    union
    {
        __IO uint8_t SET1;
        stc_gpio_set1_field_t SET1_f;
    };
    uint8_t RESERVED34[3];
    union
    {
        __IO uint8_t SET2;
        stc_gpio_set2_field_t SET2_f;
    };
    uint8_t RESERVED35[3];
    union
    {
        __IO uint8_t SET3;
        stc_gpio_set3_field_t SET3_f;
    };
    uint8_t RESERVED36[3];
    union
    {
        __IO uint8_t SET4;
        stc_gpio_set4_field_t SET4_f;
    };
    uint8_t RESERVED37[3];
    union
    {
        __IO uint8_t SET5;
        stc_gpio_set5_field_t SET5_f;
    };
    uint8_t RESERVED38[3];
    union
    {
        __IO uint8_t SET6;
        stc_gpio_set6_field_t SET6_f;
    };
    uint8_t RESERVED39[3];
    union
    {
        __IO uint8_t SET7;
        stc_gpio_set7_field_t SET7_f;
    };
    uint8_t RESERVED40[227];
    union
    {
        __IO uint32_t ANALOG;
        stc_gpio_analog_field_t ANALOG_f;
    };
    uint8_t RESERVED41[124];
    union
    {
        __IO uint8_t SPS;
        stc_gpio_sps_field_t SPS_f;
    };
    uint8_t RESERVED42[127];
    union
    {
        __IO uint32_t FN_SEL00;
        stc_gpio_fn_sel00_field_t FN_SEL00_f;
    };
    union
    {
        __IO uint32_t FN_SEL01;
        stc_gpio_fn_sel01_field_t FN_SEL01_f;
    };
    union
    {
        __IO uint32_t FN_SEL02;
        stc_gpio_fn_sel02_field_t FN_SEL02_f;
    };
    uint8_t RESERVED45[4];
    union
    {
        __IO uint32_t FN_SEL04;
        stc_gpio_fn_sel04_field_t FN_SEL04_f;
    };
    uint8_t RESERVED46[8];
    union
    {
        __IO uint32_t FN_SEL07;
        stc_gpio_fn_sel07_field_t FN_SEL07_f;
    };
    union
    {
        __IO uint32_t FN_SEL08;
        stc_gpio_fn_sel08_field_t FN_SEL08_f;
    };
    union
    {
        __IO uint32_t FN_SEL09;
        stc_gpio_fn_sel09_field_t FN_SEL09_f;
    };
    uint8_t RESERVED49[216];
    union
    {
        __IO uint8_t ODR0;
        stc_gpio_odr0_field_t ODR0_f;
    };
    uint8_t RESERVED50[3];
    union
    {
        __IO uint8_t ODR1;
        stc_gpio_odr1_field_t ODR1_f;
    };
    uint8_t RESERVED51[3];
    union
    {
        __IO uint8_t ODR2;
        stc_gpio_odr2_field_t ODR2_f;
    };
    uint8_t RESERVED52[3];
    union
    {
        __IO uint8_t ODR3;
        stc_gpio_odr3_field_t ODR3_f;
    };
    uint8_t RESERVED53[3];
    union
    {
        __IO uint8_t ODR4;
        stc_gpio_odr4_field_t ODR4_f;
    };
    uint8_t RESERVED54[3];
    union
    {
        __IO uint8_t ODR5;
        stc_gpio_odr5_field_t ODR5_f;
    };
    uint8_t RESERVED55[3];
    union
    {
        __IO uint8_t ODR6;
        stc_gpio_odr6_field_t ODR6_f;
    };
    uint8_t RESERVED56[3];
    union
    {
        __IO uint8_t ODR7;
        stc_gpio_odr7_field_t ODR7_f;
    };
    uint8_t RESERVED57[483];
    union
    {
        __IO uint8_t FSETE0;
        stc_gpio_fsete0_field_t FSETE0_f;
    };
    uint8_t RESERVED58[3];
    union
    {
        __IO uint8_t FSETE1;
        stc_gpio_fsete1_field_t FSETE1_f;
    };
    uint8_t RESERVED59[3];
    union
    {
        __IO uint8_t FSETE2;
        stc_gpio_fsete2_field_t FSETE2_f;
    };
    uint8_t RESERVED60[3];
    union
    {
        __IO uint8_t FSETE3;
        stc_gpio_fsete3_field_t FSETE3_f;
    };
    uint8_t RESERVED61[3];
    union
    {
        __IO uint8_t FSETE4;
        stc_gpio_fsete4_field_t FSETE4_f;
    };
    uint8_t RESERVED62[3];
    union
    {
        __IO uint8_t FSETE5;
        stc_gpio_fsete5_field_t FSETE5_f;
    };
    uint8_t RESERVED63[3];
    union
    {
        __IO uint8_t FSETE6;
        stc_gpio_fsete6_field_t FSETE6_f;
    };
    uint8_t RESERVED64[3];
    union
    {
        __IO uint8_t FSETE7;
        stc_gpio_fsete7_field_t FSETE7_f;
    };
}M0P_GPIO_TypeDef;

typedef struct
{
    __IO uint32_t WDT_LD;
    __IO uint32_t WDT_VL;
    union
    {
        __IO uint8_t WDT_CTL;
        stc_hwwdt_wdt_ctl_field_t WDT_CTL_f;
    };
    uint8_t RESERVED3[3];
    __IO uint8_t WDT_CLR;
    uint8_t RESERVED4[3];
    union
    {
        __IO uint8_t WDT_STA;
        stc_hwwdt_wdt_sta_field_t WDT_STA_f;
    };
    uint8_t RESERVED5[3];
    __IO uint32_t WDT_LCK;
}M0P_HWWDT_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t IRQ_DSEL;
        stc_irqc_irq_dsel_field_t IRQ_DSEL_f;
    };
    uint8_t RESERVED1[12];
    union
    {
        __IO uint32_t IRQ_ST02;
        stc_irqc_irq_st02_field_t IRQ_ST02_f;
    };
    union
    {
        __IO uint32_t IRQ00PEND;
        stc_irqc_irq00pend_field_t IRQ00PEND_f;
    };
    union
    {
        __IO uint32_t IRQ01PEND;
        stc_irqc_irq01pend_field_t IRQ01PEND_f;
    };
    union
    {
        __IO uint32_t IRQ02PEND;
        stc_irqc_irq02pend_field_t IRQ02PEND_f;
    };
    union
    {
        __IO uint32_t IRQ03PEND;
        stc_irqc_irq03pend_field_t IRQ03PEND_f;
    };
    union
    {
        __IO uint32_t IRQ04PEND;
        stc_irqc_irq04pend_field_t IRQ04PEND_f;
    };
    union
    {
        __IO uint32_t IRQ05PEND;
        stc_irqc_irq05pend_field_t IRQ05PEND_f;
    };
    union
    {
        __IO uint32_t IRQ06PEND;
        stc_irqc_irq06pend_field_t IRQ06PEND_f;
    };
    uint8_t RESERVED9[32];
    union
    {
        __IO uint32_t IRQ15PEND;
        stc_irqc_irq15pend_field_t IRQ15PEND_f;
    };
    union
    {
        __IO uint32_t IRQ16PEND;
        stc_irqc_irq16pend_field_t IRQ16PEND_f;
    };
    union
    {
        __IO uint32_t IRQ17PEND;
        stc_irqc_irq17pend_field_t IRQ17PEND_f;
    };
    union
    {
        __IO uint32_t IRQ18PEND;
        stc_irqc_irq18pend_field_t IRQ18PEND_f;
    };
    union
    {
        __IO uint32_t IRQ19PEND;
        stc_irqc_irq19pend_field_t IRQ19PEND_f;
    };
    union
    {
        __IO uint32_t IRQ20PEND;
        stc_irqc_irq20pend_field_t IRQ20PEND_f;
    };
    uint8_t RESERVED15[12];
    union
    {
        __IO uint32_t IRQ24PEND;
        stc_irqc_irq24pend_field_t IRQ24PEND_f;
    };
    union
    {
        __IO uint32_t IRQ25PEND;
        stc_irqc_irq25pend_field_t IRQ25PEND_f;
    };
    union
    {
        __IO uint32_t IRQ26PEND;
        stc_irqc_irq26pend_field_t IRQ26PEND_f;
    };
    uint8_t RESERVED18[4];
    union
    {
        __IO uint32_t IRQ28PEND;
        stc_irqc_irq28pend_field_t IRQ28PEND_f;
    };
    uint8_t RESERVED19[4];
    union
    {
        __IO uint32_t IRQ30PEND;
        stc_irqc_irq30pend_field_t IRQ30PEND_f;
    };
    union
    {
        __IO uint32_t IRQ31PEND;
        stc_irqc_irq31pend_field_t IRQ31PEND_f;
    };
}M0P_IRQC_TypeDef;

typedef struct
{
    union
    {
        __IO uint8_t MR;
        stc_msc_i2c_mr_field_t MR_f;
    };
    union
    {
        __IO uint8_t BC;
        stc_msc_i2c_bc_field_t BC_f;
    };
    uint8_t RESERVED2[2];
    union
    {
        __IO uint8_t BS;
        stc_msc_i2c_bs_field_t BS_f;
    };
    union
    {
        __IO uint8_t SR;
        stc_msc_i2c_sr_field_t SR_f;
    };
    uint8_t RESERVED4[2];
    union
    {
        __IO uint16_t RXDR;
        __IO uint16_t TXDR;
    };
    uint8_t RESERVED6[2];
    union
    {
        __IO uint16_t BRS;
        stc_msc_i2c_brs_field_t BRS_f;
    };
    uint8_t RESERVED7[2];
    union
    {
        __IO uint8_t SA;
        stc_msc_i2c_sa_field_t SA_f;
    };
    union
    {
        __IO uint8_t SAMSK;
        stc_msc_i2c_samsk_field_t SAMSK_f;
    };
    uint8_t RESERVED9[11];
    union
    {
        __IO uint8_t EBCR;
        stc_msc_i2c_ebcr_field_t EBCR_f;
    };
}M0P_MSC_I2C_TypeDef;

typedef struct
{
    union
    {
        __IO uint8_t MR;
        stc_msc_spi_mr_field_t MR_f;
    };
    union
    {
        __IO uint8_t CR;
        stc_msc_spi_cr_field_t CR_f;
    };
    uint8_t RESERVED2[2];
    union
    {
        __IO uint8_t ECR;
        stc_msc_spi_ecr_field_t ECR_f;
    };
    union
    {
        __IO uint8_t SR;
        stc_msc_spi_sr_field_t SR_f;
    };
    uint8_t RESERVED4[2];
    union
    {
        __IO uint16_t RXDR;
        __IO uint16_t TXDR;
    };
    uint8_t RESERVED6[2];
    union
    {
        __IO uint16_t BRS;
        stc_msc_spi_brs_field_t BRS_f;
    };
    uint8_t RESERVED7[14];
    union
    {
        __IO uint8_t CSTMG0;
        stc_msc_spi_cstmg0_field_t CSTMG0_f;
    };
    union
    {
        __IO uint8_t CSTMG1;
        stc_msc_spi_cstmg1_field_t CSTMG1_f;
    };
    uint8_t RESERVED9[2];
    union
    {
        __IO uint16_t CSTMG32;
        stc_msc_spi_cstmg32_field_t CSTMG32_f;
    };
    uint8_t RESERVED10[2];
    union
    {
        __IO uint16_t EACR;
        stc_msc_spi_eacr_field_t EACR_f;
    };
    uint8_t RESERVED11[2];
    union
    {
        __IO uint16_t TMR;
        stc_msc_spi_tmr_field_t TMR_f;
    };
    uint8_t RESERVED12[2];
    union
    {
        __IO uint16_t TMC;
        stc_msc_spi_tmc_field_t TMC_f;
    };
    uint8_t RESERVED13[2];
    union
    {
        __IO uint16_t CSCR;
        stc_msc_spi_cscr_field_t CSCR_f;
    };
    uint8_t RESERVED14[2];
    union
    {
        __IO uint8_t CSFR0;
        stc_msc_spi_csfr0_field_t CSFR0_f;
    };
    union
    {
        __IO uint8_t CSFR1;
        stc_msc_spi_csfr1_field_t CSFR1_f;
    };
    uint8_t RESERVED16[2];
    union
    {
        __IO uint8_t CSFR2;
        stc_msc_spi_csfr2_field_t CSFR2_f;
    };
    uint8_t RESERVED17[3];
    union
    {
        __IO uint8_t TDTCNT0;
        stc_msc_spi_tdtcnt0_field_t TDTCNT0_f;
    };
    union
    {
        __IO uint8_t TDTCNT1;
        stc_msc_spi_tdtcnt1_field_t TDTCNT1_f;
    };
    uint8_t RESERVED19[2];
    union
    {
        __IO uint8_t TDTCNT2;
        stc_msc_spi_tdtcnt2_field_t TDTCNT2_f;
    };
    union
    {
        __IO uint8_t TDTCNT3;
        stc_msc_spi_tdtcnt3_field_t TDTCNT3_f;
    };
}M0P_MSC_SPI_TypeDef;

typedef struct
{
    union
    {
        __IO uint8_t MR;
        stc_msc_uart_mr_field_t MR_f;
    };
    union
    {
        __IO uint8_t CR;
        stc_msc_uart_cr_field_t CR_f;
    };
    uint8_t RESERVED2[2];
    union
    {
        __IO uint8_t ECR;
        stc_msc_uart_ecr_field_t ECR_f;
    };
    union
    {
        __IO uint8_t SR;
        stc_msc_uart_sr_field_t SR_f;
    };
    uint8_t RESERVED4[2];
    union
    {
        __IO uint16_t RXDR;
        __IO uint16_t TXDR;
    };
    uint8_t RESERVED6[2];
    union
    {
        __IO uint16_t BRS;
        stc_msc_uart_brs_field_t BRS_f;
    };
    uint8_t RESERVED7[66];
    union
    {
        __IO uint16_t COMP;
        stc_msc_uart_comp_field_t COMP_f;
    };
}M0P_MSC_UART_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t ACSTR;
        stc_mtb_dwt_acstr_field_t ACSTR_f;
    };
    union
    {
        __IO uint32_t DCSTR;
        stc_mtb_dwt_dcstr_field_t DCSTR_f;
    };
    union
    {
        __IO uint32_t MDCSTR;
        stc_mtb_dwt_mdcstr_field_t MDCSTR_f;
    };
    uint8_t RESERVED3[4];
    union
    {
        __IO uint32_t ACSPR;
        stc_mtb_dwt_acspr_field_t ACSPR_f;
    };
    union
    {
        __IO uint32_t DCSPR;
        stc_mtb_dwt_dcspr_field_t DCSPR_f;
    };
    union
    {
        __IO uint32_t MDCSPR;
        stc_mtb_dwt_mdcspr_field_t MDCSPR_f;
    };
    uint8_t RESERVED6[4];
    union
    {
        __IO uint8_t FCT;
        stc_mtb_dwt_fct_field_t FCT_f;
    };
    uint8_t RESERVED7[4015];
    union
    {
        __IO uint32_t PID4;
        stc_mtb_dwt_pid4_field_t PID4_f;
    };
    union
    {
        __IO uint32_t PID5;
        stc_mtb_dwt_pid5_field_t PID5_f;
    };
    union
    {
        __IO uint32_t PID6;
        stc_mtb_dwt_pid6_field_t PID6_f;
    };
    union
    {
        __IO uint32_t PID7;
        stc_mtb_dwt_pid7_field_t PID7_f;
    };
    union
    {
        __IO uint32_t PID0;
        stc_mtb_dwt_pid0_field_t PID0_f;
    };
    union
    {
        __IO uint32_t PID1;
        stc_mtb_dwt_pid1_field_t PID1_f;
    };
    union
    {
        __IO uint32_t PID2;
        stc_mtb_dwt_pid2_field_t PID2_f;
    };
    union
    {
        __IO uint32_t PID3;
        stc_mtb_dwt_pid3_field_t PID3_f;
    };
    union
    {
        __IO uint32_t CID0;
        stc_mtb_dwt_cid0_field_t CID0_f;
    };
    union
    {
        __IO uint32_t CID1;
        stc_mtb_dwt_cid1_field_t CID1_f;
    };
    union
    {
        __IO uint32_t CID2;
        stc_mtb_dwt_cid2_field_t CID2_f;
    };
    union
    {
        __IO uint32_t CID3;
        stc_mtb_dwt_cid3_field_t CID3_f;
    };
}M0P_MTB_DWT_TypeDef;

typedef struct
{
    union
    {
        __IO uint8_t OPA_CTL;
        stc_opa_ctl_field_t OPA_CTL_f;
    };
}M0P_OPA_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t HICR_TRMKEY;
        stc_osc_ctl_hicr_trmkey_field_t HICR_TRMKEY_f;
    };
    union
    {
        __IO uint32_t HICR_FTRM;
        stc_osc_ctl_hicr_ftrm_field_t HICR_FTRM_f;
    };
    union
    {
        __IO uint32_t HICR_TTRM;
        stc_osc_ctl_hicr_ttrm_field_t HICR_TTRM_f;
    };
    uint8_t RESERVED3[4];
    union
    {
        __IO uint8_t HICR_FDIV;
        stc_osc_ctl_hicr_fdiv_field_t HICR_FDIV_f;
    };
    uint8_t RESERVED4[15];
    union
    {
        __IO uint32_t HSXT_PWRCTL;
        stc_osc_ctl_hsxt_pwrctl_field_t HSXT_PWRCTL_f;
    };
    uint8_t RESERVED5[12];
    union
    {
        __IO uint32_t LSXT_PWRCTL;
        stc_osc_ctl_lsxt_pwrctl_field_t LSXT_PWRCTL_f;
    };
}M0P_OSC_CTL_TypeDef;

typedef struct
{
    union
    {
        __IO uint8_t PARITY_CTL;
        stc_parity_ctl_field_t PARITY_CTL_f;
    };
    uint8_t RESERVED1[3];
    union
    {
        __IO uint32_t PARITY_ADDR;
        stc_parity_addr_field_t PARITY_ADDR_f;
    };
}M0P_PARITY_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t CLKEN0;
        stc_pcg_clken0_field_t CLKEN0_f;
    };
    union
    {
        __IO uint32_t RSTCTL0;
        stc_pcg_rstctl0_field_t RSTCTL0_f;
    };
    uint8_t RESERVED2[8];
    union
    {
        __IO uint32_t CLKEN1;
        stc_pcg_clken1_field_t CLKEN1_f;
    };
    union
    {
        __IO uint32_t RSTCTL1;
        stc_pcg_rstctl1_field_t RSTCTL1_f;
    };
    uint8_t RESERVED4[8];
    union
    {
        __IO uint32_t CLKEN2;
        stc_pcg_clken2_field_t CLKEN2_f;
    };
    union
    {
        __IO uint32_t RSTCTL2;
        stc_pcg_rstctl2_field_t RSTCTL2_f;
    };
}M0P_PCG_TypeDef;

typedef struct
{
    __IO uint32_t WDT_LD;
    __IO uint32_t WDT_VL;
    union
    {
        __IO uint8_t WDT_CTL;
        stc_swwdt_wdt_ctl_field_t WDT_CTL_f;
    };
    uint8_t RESERVED3[3];
    __IO uint32_t WDT_INTCLR;
    union
    {
        __IO uint8_t WDT_STA;
        stc_swwdt_wdt_sta_field_t WDT_STA_f;
    };
    uint8_t RESERVED5[7];
    union
    {
        __IO uint8_t WDT_MDC;
        stc_swwdt_wdt_mdc_field_t WDT_MDC_f;
    };
    uint8_t RESERVED6[3047];
    __IO uint32_t WDT_LCK;
}M0P_SWWDT_TypeDef;

typedef struct
{
    uint8_t RESERVED0[2];
    __IO uint16_t OCCR0;
    uint8_t RESERVED1[2];
    __IO uint16_t OCCR1;
    uint8_t RESERVED2[2];
    __IO uint16_t OCCR2;
    uint8_t RESERVED3[2];
    __IO uint16_t OCCR3;
    uint8_t RESERVED4[2];
    __IO uint16_t OCCR4;
    uint8_t RESERVED5[2];
    __IO uint16_t OCCR5;
    union
    {
        __IO uint8_t OCSR10;
        stc_timer4_ocsr10_field_t OCSR10_f;
    };
    uint8_t RESERVED7[1];
    union
    {
        __IO uint16_t OCER10;
        stc_timer4_ocer10_field_t OCER10_f;
    };
    union
    {
        __IO uint8_t OCSR32;
        stc_timer4_ocsr32_field_t OCSR32_f;
    };
    uint8_t RESERVED9[1];
    union
    {
        __IO uint16_t OCER32;
        stc_timer4_ocer32_field_t OCER32_f;
    };
    union
    {
        __IO uint8_t OCSR54;
        stc_timer4_ocsr54_field_t OCSR54_f;
    };
    uint8_t RESERVED11[1];
    union
    {
        __IO uint16_t OCER54;
        stc_timer4_ocer54_field_t OCER54_f;
    };
    union
    {
        __IO uint16_t OCMR0;
        stc_timer4_ocmr0_field_t OCMR0_f;
    };
    uint8_t RESERVED13[2];
    union
    {
        __IO uint32_t OCMR1;
        stc_timer4_ocmr1_field_t OCMR1_f;
    };
    union
    {
        __IO uint16_t OCMR2;
        stc_timer4_ocmr2_field_t OCMR2_f;
    };
    uint8_t RESERVED15[2];
    union
    {
        __IO uint32_t OCMR3;
        stc_timer4_ocmr3_field_t OCMR3_f;
    };
    union
    {
        __IO uint16_t OCMR4;
        stc_timer4_ocmr4_field_t OCMR4_f;
    };
    uint8_t RESERVED17[2];
    union
    {
        __IO uint32_t OCMR5;
        stc_timer4_ocmr5_field_t OCMR5_f;
    };
    uint8_t RESERVED18[6];
    __IO uint16_t CPSR;
    uint8_t RESERVED19[2];
    __IO uint16_t CISR;
    union
    {
        __IO uint16_t CCSR;
        stc_timer4_ccsr_field_t CCSR_f;
    };
    union
    {
        __IO uint16_t CIMR;
        stc_timer4_cimr_field_t CIMR_f;
    };
    uint8_t RESERVED22[54];
    __IO uint16_t PFSR10;
    __IO uint16_t PDRA10;
    __IO uint16_t PDRB10;
    uint8_t RESERVED25[2];
    __IO uint16_t PFSR32;
    __IO uint16_t PDRA32;
    __IO uint16_t PDRB32;
    uint8_t RESERVED28[2];
    __IO uint16_t PFSR54;
    __IO uint16_t PDRA54;
    __IO uint16_t PDRB54;
    union
    {
        __IO uint8_t POCR10;
        stc_timer4_pocr10_field_t POCR10_f;
    };
    uint8_t RESERVED32[3];
    union
    {
        __IO uint8_t POCR32;
        stc_timer4_pocr32_field_t POCR32_f;
    };
    uint8_t RESERVED33[3];
    union
    {
        __IO uint8_t POCR54;
        stc_timer4_pocr54_field_t POCR54_f;
    };
    uint8_t RESERVED34[3];
    union
    {
        __IO uint16_t RCSR;
        stc_timer4_rcsr_field_t RCSR_f;
    };
    uint8_t RESERVED35[12];
    __IO uint16_t ATVR0;
    uint8_t RESERVED36[2];
    __IO uint16_t ATVR1;
    uint8_t RESERVED37[2];
    __IO uint16_t ATVR2;
    uint8_t RESERVED38[2];
    __IO uint16_t ATVR3;
    uint8_t RESERVED39[2];
    __IO uint16_t ATVR4;
    uint8_t RESERVED40[2];
    __IO uint16_t ATVR5;
    union
    {
        __IO uint8_t ATCR0;
        stc_timer4_atcr0_field_t ATCR0_f;
    };
    union
    {
        __IO uint8_t ATER0;
        stc_timer4_ater0_field_t ATER0_f;
    };
    union
    {
        __IO uint8_t ATMR0;
        stc_timer4_atmr0_field_t ATMR0_f;
    };
    uint8_t RESERVED44[1];
    union
    {
        __IO uint8_t ATCR1;
        stc_timer4_atcr1_field_t ATCR1_f;
    };
    union
    {
        __IO uint8_t ATER1;
        stc_timer4_ater1_field_t ATER1_f;
    };
    union
    {
        __IO uint8_t ATMR1;
        stc_timer4_atmr1_field_t ATMR1_f;
    };
    uint8_t RESERVED47[1];
    union
    {
        __IO uint8_t ATCR2;
        stc_timer4_atcr2_field_t ATCR2_f;
    };
    union
    {
        __IO uint8_t ATER2;
        stc_timer4_ater2_field_t ATER2_f;
    };
    union
    {
        __IO uint8_t ATMR2;
        stc_timer4_atmr2_field_t ATMR2_f;
    };
    uint8_t RESERVED50[1];
    union
    {
        __IO uint8_t ATCR3;
        stc_timer4_atcr3_field_t ATCR3_f;
    };
    union
    {
        __IO uint8_t ATER3;
        stc_timer4_ater3_field_t ATER3_f;
    };
    union
    {
        __IO uint8_t ATMR3;
        stc_timer4_atmr3_field_t ATMR3_f;
    };
    uint8_t RESERVED53[1];
    union
    {
        __IO uint8_t ATCR4;
        stc_timer4_atcr4_field_t ATCR4_f;
    };
    union
    {
        __IO uint8_t ATER4;
        stc_timer4_ater4_field_t ATER4_f;
    };
    union
    {
        __IO uint8_t ATMR4;
        stc_timer4_atmr4_field_t ATMR4_f;
    };
    uint8_t RESERVED56[1];
    union
    {
        __IO uint8_t ATCR5;
        stc_timer4_atcr5_field_t ATCR5_f;
    };
    union
    {
        __IO uint8_t ATER5;
        stc_timer4_ater5_field_t ATER5_f;
    };
    union
    {
        __IO uint8_t ATMR5;
        stc_timer4_atmr5_field_t ATMR5_f;
    };
    uint8_t RESERVED59[17];
    union
    {
        __IO uint16_t ESCR;
        stc_timer4_escr_field_t ESCR_f;
    };
}M0P_TIMER4_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t UIDR0;
        stc_uid_uidr0_field_t UIDR0_f;
    };
    union
    {
        __IO uint32_t UIDR1;
        stc_uid_uidr1_field_t UIDR1_f;
    };
    union
    {
        __IO uint32_t UIDR2;
        stc_uid_uidr2_field_t UIDR2_f;
    };
}M0P_UID_TypeDef;

