MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32M140KA/mcu.h
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY12               *((volatile unsigned int*)(0x425C0030UL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY13               *((volatile unsigned int*)(0x425C0034UL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY14               *((volatile unsigned int*)(0x425C0038UL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY15               *((volatile unsigned int*)(0x425C003CUL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY16               *((volatile unsigned int*)(0x425C0040UL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY17               *((volatile unsigned int*)(0x425C0044UL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY18               *((volatile unsigned int*)(0x425C0048UL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY19               *((volatile unsigned int*)(0x425C004CUL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY20               *((volatile unsigned int*)(0x425C0050UL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY21               *((volatile unsigned int*)(0x425C0054UL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY22               *((volatile unsigned int*)(0x425C0058UL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY23               *((volatile unsigned int*)(0x425C005CUL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY24               *((volatile unsigned int*)(0x425C0060UL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY25               *((volatile unsigned int*)(0x425C0064UL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY26               *((volatile unsigned int*)(0x425C0068UL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY27               *((volatile unsigned int*)(0x425C006CUL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY28               *((volatile unsigned int*)(0x425C0070UL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY29               *((volatile unsigned int*)(0x425C0074UL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY30               *((volatile unsigned int*)(0x425C0078UL))
#define bM0P_OSC_CTL_HICR_TRMKEY_TRMKEY31               *((volatile unsigned int*)(0x425C007CUL))
#define bM0P_OSC_CTL_HICR_FTRM_CR4MFTRM0                *((volatile unsigned int*)(0x425C0080UL))
#define bM0P_OSC_CTL_HICR_FTRM_CR4MFTRM1                *((volatile unsigned int*)(0x425C0084UL))
#define bM0P_OSC_CTL_HICR_FTRM_CR4MFTRM2                *((volatile unsigned int*)(0x425C0088UL))
#define bM0P_OSC_CTL_HICR_FTRM_CR4MFTRM3                *((volatile unsigned int*)(0x425C008CUL))
#define bM0P_OSC_CTL_HICR_FTRM_CR4MFTRM4                *((volatile unsigned int*)(0x425C0090UL))
#define bM0P_OSC_CTL_HICR_FTRM_CR4MFTRM5                *((volatile unsigned int*)(0x425C0094UL))
#define bM0P_OSC_CTL_HICR_FTRM_CR4MFTRM6                *((volatile unsigned int*)(0x425C0098UL))
#define bM0P_OSC_CTL_HICR_FTRM_CR4MFTRM7                *((volatile unsigned int*)(0x425C009CUL))
#define bM0P_OSC_CTL_HICR_TTRM_CR4MTTRM0                *((volatile unsigned int*)(0x425C0100UL))
#define bM0P_OSC_CTL_HICR_TTRM_CR4MTTRM1                *((volatile unsigned int*)(0x425C0104UL))
#define bM0P_OSC_CTL_HICR_TTRM_CR4MTTRM2                *((volatile unsigned int*)(0x425C0108UL))
#define bM0P_OSC_CTL_HICR_TTRM_CR4MTTRM3                *((volatile unsigned int*)(0x425C010CUL))
#define bM0P_OSC_CTL_HICR_FDIV_FDIV0                    *((volatile unsigned int*)(0x425C0200UL))
#define bM0P_OSC_CTL_HICR_FDIV_FDIV1                    *((volatile unsigned int*)(0x425C0204UL))
#define bM0P_OSC_CTL_HICR_FDIV_FDIV2                    *((volatile unsigned int*)(0x425C0208UL))
#define bM0P_OSC_CTL_HSXT_PWRCTL_HXSEL0                 *((volatile unsigned int*)(0x425C0400UL))
#define bM0P_OSC_CTL_HSXT_PWRCTL_HXSEL1                 *((volatile unsigned int*)(0x425C0404UL))
#define bM0P_OSC_CTL_HSXT_PWRCTL_HIBS0                  *((volatile unsigned int*)(0x425C0440UL))
#define bM0P_OSC_CTL_HSXT_PWRCTL_HIBS1                  *((volatile unsigned int*)(0x425C0444UL))
#define bM0P_OSC_CTL_LSXT_PWRCTL_LIBS0                  *((volatile unsigned int*)(0x425C0640UL))
#define bM0P_OSC_CTL_LSXT_PWRCTL_LIBS1                  *((volatile unsigned int*)(0x425C0644UL))
#define bM0P_OSC_CTL_LSXT_PWRCTL_LIBS2                  *((volatile unsigned int*)(0x425C0648UL))
#define bM0P_PARITY_PARITY_CTL_PE                       *((volatile unsigned int*)(0x42780000UL))
#define bM0P_PARITY_PARITY_CTL_PIE                      *((volatile unsigned int*)(0x42780004UL))
#define bM0P_PARITY_PARITY_CTL_PERROR                   *((volatile unsigned int*)(0x42780010UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR0                   *((volatile unsigned int*)(0x42780080UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR1                   *((volatile unsigned int*)(0x42780084UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR2                   *((volatile unsigned int*)(0x42780088UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR3                   *((volatile unsigned int*)(0x4278008CUL))
#define bM0P_PARITY_PARITY_ADDR_ADDR4                   *((volatile unsigned int*)(0x42780090UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR5                   *((volatile unsigned int*)(0x42780094UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR6                   *((volatile unsigned int*)(0x42780098UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR7                   *((volatile unsigned int*)(0x4278009CUL))
#define bM0P_PARITY_PARITY_ADDR_ADDR8                   *((volatile unsigned int*)(0x427800A0UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR9                   *((volatile unsigned int*)(0x427800A4UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR10                  *((volatile unsigned int*)(0x427800A8UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR11                  *((volatile unsigned int*)(0x427800ACUL))
#define bM0P_PARITY_PARITY_ADDR_ADDR12                  *((volatile unsigned int*)(0x427800B0UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR13                  *((volatile unsigned int*)(0x427800B4UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR14                  *((volatile unsigned int*)(0x427800B8UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR15                  *((volatile unsigned int*)(0x427800BCUL))
#define bM0P_PARITY_PARITY_ADDR_ADDR16                  *((volatile unsigned int*)(0x427800C0UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR17                  *((volatile unsigned int*)(0x427800C4UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR18                  *((volatile unsigned int*)(0x427800C8UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR19                  *((volatile unsigned int*)(0x427800CCUL))
#define bM0P_PARITY_PARITY_ADDR_ADDR20                  *((volatile unsigned int*)(0x427800D0UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR21                  *((volatile unsigned int*)(0x427800D4UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR22                  *((volatile unsigned int*)(0x427800D8UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR23                  *((volatile unsigned int*)(0x427800DCUL))
#define bM0P_PARITY_PARITY_ADDR_ADDR24                  *((volatile unsigned int*)(0x427800E0UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR25                  *((volatile unsigned int*)(0x427800E4UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR26                  *((volatile unsigned int*)(0x427800E8UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR27                  *((volatile unsigned int*)(0x427800ECUL))
#define bM0P_PARITY_PARITY_ADDR_ADDR28                  *((volatile unsigned int*)(0x427800F0UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR29                  *((volatile unsigned int*)(0x427800F4UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR30                  *((volatile unsigned int*)(0x427800F8UL))
#define bM0P_PARITY_PARITY_ADDR_ADDR31                  *((volatile unsigned int*)(0x427800FCUL))
#define bM0P_PCG_CLKEN0_MSC4CK                          *((volatile unsigned int*)(0x42782010UL))
#define bM0P_PCG_CLKEN0_MSC5CK                          *((volatile unsigned int*)(0x42782014UL))
#define bM0P_PCG_CLKEN0_MSC6CK                          *((volatile unsigned int*)(0x42782018UL))
#define bM0P_PCG_CLKEN0_ADCCK                           *((volatile unsigned int*)(0x42782040UL))
#define bM0P_PCG_CLKEN0_DMACK                           *((volatile unsigned int*)(0x42782060UL))
#define bM0P_PCG_CLKEN0_GIOCK                           *((volatile unsigned int*)(0x42782070UL))
#define bM0P_PCG_RSTCTL0_MSC4RST                        *((volatile unsigned int*)(0x42782090UL))
#define bM0P_PCG_RSTCTL0_MSC5RST                        *((volatile unsigned int*)(0x42782094UL))
#define bM0P_PCG_RSTCTL0_MSC6RST                        *((volatile unsigned int*)(0x42782098UL))
#define bM0P_PCG_RSTCTL0_ADCRST                         *((volatile unsigned int*)(0x427820C0UL))
#define bM0P_PCG_RSTCTL0_DMARST                         *((volatile unsigned int*)(0x427820E0UL))
#define bM0P_PCG_CLKEN1_CTCK                            *((volatile unsigned int*)(0x42782200UL))
#define bM0P_PCG_CLKEN1_VCCK                            *((volatile unsigned int*)(0x42782210UL))
#define bM0P_PCG_CLKEN1_TM4CK                           *((volatile unsigned int*)(0x42782220UL))
#define bM0P_PCG_CLKEN1_OPA0CK                          *((volatile unsigned int*)(0x42782230UL))
#define bM0P_PCG_CLKEN1_OPA1CK                          *((volatile unsigned int*)(0x42782234UL))
#define bM0P_PCG_RSTCTL1_CTMRST                         *((volatile unsigned int*)(0x42782280UL))
#define bM0P_PCG_RSTCTL1_VCRST                          *((volatile unsigned int*)(0x42782290UL))
#define bM0P_PCG_RSTCTL1_TM4RST                         *((volatile unsigned int*)(0x427822A0UL))
#define bM0P_PCG_RSTCTL1_OPA0RST                        *((volatile unsigned int*)(0x427822B0UL))
#define bM0P_PCG_RSTCTL1_OPA1RST                        *((volatile unsigned int*)(0x427822B4UL))
#define bM0P_PCG_CLKEN2_LCDCCK                          *((volatile unsigned int*)(0x42782440UL))
#define bM0P_PCG_RSTCTL2_LCDCRST                        *((volatile unsigned int*)(0x427824C0UL))
#define bM0P_SWWDT_WDT_CTL_IE                           *((volatile unsigned int*)(0x42240100UL))
#define bM0P_SWWDT_WDT_CTL_RSTEN                        *((volatile unsigned int*)(0x42240104UL))
#define bM0P_SWWDT_WDT_CTL_TMWD0                        *((volatile unsigned int*)(0x42240108UL))
#define bM0P_SWWDT_WDT_CTL_TMWD1                        *((volatile unsigned int*)(0x4224010CUL))
#define bM0P_SWWDT_WDT_CTL_WDM                          *((volatile unsigned int*)(0x42240110UL))
#define bM0P_SWWDT_WDT_STA_STA                          *((volatile unsigned int*)(0x42240200UL))
#define bM0P_SWWDT_WDT_MDC_TRG                          *((volatile unsigned int*)(0x42240300UL))
#define bM0P_TIMER4_OCSR10_OCE0                         *((volatile unsigned int*)(0x42400300UL))
#define bM0P_TIMER4_OCSR10_OCE1                         *((volatile unsigned int*)(0x42400304UL))
#define bM0P_TIMER4_OCSR10_OCP0                         *((volatile unsigned int*)(0x42400308UL))
#define bM0P_TIMER4_OCSR10_OCP1                         *((volatile unsigned int*)(0x4240030CUL))
#define bM0P_TIMER4_OCSR10_OCIE0                        *((volatile unsigned int*)(0x42400310UL))
#define bM0P_TIMER4_OCSR10_OCIE1                        *((volatile unsigned int*)(0x42400314UL))
#define bM0P_TIMER4_OCSR10_OCF0                         *((volatile unsigned int*)(0x42400318UL))
#define bM0P_TIMER4_OCSR10_OCF1                         *((volatile unsigned int*)(0x4240031CUL))
#define bM0P_TIMER4_OCER10_C0BUFEN0                     *((volatile unsigned int*)(0x42400340UL))
#define bM0P_TIMER4_OCER10_C0BUFEN1                     *((volatile unsigned int*)(0x42400344UL))
#define bM0P_TIMER4_OCER10_C1BUFEN0                     *((volatile unsigned int*)(0x42400348UL))
#define bM0P_TIMER4_OCER10_C1BUFEN1                     *((volatile unsigned int*)(0x4240034CUL))
#define bM0P_TIMER4_OCER10_M0BUFEN0                     *((volatile unsigned int*)(0x42400350UL))
#define bM0P_TIMER4_OCER10_M0BUFEN1                     *((volatile unsigned int*)(0x42400354UL))
#define bM0P_TIMER4_OCER10_M1BUFEN0                     *((volatile unsigned int*)(0x42400358UL))
#define bM0P_TIMER4_OCER10_M1BUFEN1                     *((volatile unsigned int*)(0x4240035CUL))
#define bM0P_TIMER4_OCER10_LMC0                         *((volatile unsigned int*)(0x42400360UL))
#define bM0P_TIMER4_OCER10_LMC1                         *((volatile unsigned int*)(0x42400364UL))
#define bM0P_TIMER4_OCER10_LMM0                         *((volatile unsigned int*)(0x42400368UL))
#define bM0P_TIMER4_OCER10_LMM1                         *((volatile unsigned int*)(0x4240036CUL))
#define bM0P_TIMER4_OCER10_MCEC0                        *((volatile unsigned int*)(0x42400370UL))
#define bM0P_TIMER4_OCER10_MCEC1                        *((volatile unsigned int*)(0x42400374UL))
#define bM0P_TIMER4_OCSR32_OCE0                         *((volatile unsigned int*)(0x42400380UL))
#define bM0P_TIMER4_OCSR32_OCE1                         *((volatile unsigned int*)(0x42400384UL))
#define bM0P_TIMER4_OCSR32_OCP0                         *((volatile unsigned int*)(0x42400388UL))
#define bM0P_TIMER4_OCSR32_OCP1                         *((volatile unsigned int*)(0x4240038CUL))
#define bM0P_TIMER4_OCSR32_OCIE0                        *((volatile unsigned int*)(0x42400390UL))
#define bM0P_TIMER4_OCSR32_OCIE1                        *((volatile unsigned int*)(0x42400394UL))
#define bM0P_TIMER4_OCSR32_OCF0                         *((volatile unsigned int*)(0x42400398UL))
#define bM0P_TIMER4_OCSR32_OCF1                         *((volatile unsigned int*)(0x4240039CUL))
#define bM0P_TIMER4_OCER32_C0BUFEN0                     *((volatile unsigned int*)(0x424003C0UL))
#define bM0P_TIMER4_OCER32_C0BUFEN1                     *((volatile unsigned int*)(0x424003C4UL))
#define bM0P_TIMER4_OCER32_C1BUFEN0                     *((volatile unsigned int*)(0x424003C8UL))
#define bM0P_TIMER4_OCER32_C1BUFEN1                     *((volatile unsigned int*)(0x424003CCUL))
#define bM0P_TIMER4_OCER32_M0BUFEN0                     *((volatile unsigned int*)(0x424003D0UL))
#define bM0P_TIMER4_OCER32_M0BUFEN1                     *((volatile unsigned int*)(0x424003D4UL))
#define bM0P_TIMER4_OCER32_M1BUFEN0                     *((volatile unsigned int*)(0x424003D8UL))
#define bM0P_TIMER4_OCER32_M1BUFEN1                     *((volatile unsigned int*)(0x424003DCUL))
#define bM0P_TIMER4_OCER32_LMC0                         *((volatile unsigned int*)(0x424003E0UL))
#define bM0P_TIMER4_OCER32_LMC1                         *((volatile unsigned int*)(0x424003E4UL))
#define bM0P_TIMER4_OCER32_LMM0                         *((volatile unsigned int*)(0x424003E8UL))
#define bM0P_TIMER4_OCER32_LMM1                         *((volatile unsigned int*)(0x424003ECUL))
#define bM0P_TIMER4_OCER32_MCEC0                        *((volatile unsigned int*)(0x424003F0UL))
#define bM0P_TIMER4_OCER32_MCEC1                        *((volatile unsigned int*)(0x424003F4UL))
#define bM0P_TIMER4_OCSR54_OCE0                         *((volatile unsigned int*)(0x42400400UL))
#define bM0P_TIMER4_OCSR54_OCE1                         *((volatile unsigned int*)(0x42400404UL))
#define bM0P_TIMER4_OCSR54_OCP0                         *((volatile unsigned int*)(0x42400408UL))
#define bM0P_TIMER4_OCSR54_OCP1                         *((volatile unsigned int*)(0x4240040CUL))
#define bM0P_TIMER4_OCSR54_OCIE0                        *((volatile unsigned int*)(0x42400410UL))
#define bM0P_TIMER4_OCSR54_OCIE1                        *((volatile unsigned int*)(0x42400414UL))
#define bM0P_TIMER4_OCSR54_OCF0                         *((volatile unsigned int*)(0x42400418UL))
#define bM0P_TIMER4_OCSR54_OCF1                         *((volatile unsigned int*)(0x4240041CUL))
#define bM0P_TIMER4_OCER54_C0BUFEN0                     *((volatile unsigned int*)(0x42400440UL))
#define bM0P_TIMER4_OCER54_C0BUFEN1                     *((volatile unsigned int*)(0x42400444UL))
#define bM0P_TIMER4_OCER54_C1BUFEN0                     *((volatile unsigned int*)(0x42400448UL))
#define bM0P_TIMER4_OCER54_C1BUFEN1                     *((volatile unsigned int*)(0x4240044CUL))
#define bM0P_TIMER4_OCER54_M0BUFEN0                     *((volatile unsigned int*)(0x42400450UL))
#define bM0P_TIMER4_OCER54_M0BUFEN1                     *((volatile unsigned int*)(0x42400454UL))
#define bM0P_TIMER4_OCER54_M1BUFEN0                     *((volatile unsigned int*)(0x42400458UL))
#define bM0P_TIMER4_OCER54_M1BUFEN1                     *((volatile unsigned int*)(0x4240045CUL))
#define bM0P_TIMER4_OCER54_LMC0                         *((volatile unsigned int*)(0x42400460UL))
#define bM0P_TIMER4_OCER54_LMC1                         *((volatile unsigned int*)(0x42400464UL))
#define bM0P_TIMER4_OCER54_LMM0                         *((volatile unsigned int*)(0x42400468UL))
#define bM0P_TIMER4_OCER54_LMM1                         *((volatile unsigned int*)(0x4240046CUL))
#define bM0P_TIMER4_OCER54_MCEC0                        *((volatile unsigned int*)(0x42400470UL))
#define bM0P_TIMER4_OCER54_MCEC1                        *((volatile unsigned int*)(0x42400474UL))
#define bM0P_TIMER4_OCMR0_OCMR0                         *((volatile unsigned int*)(0x42400480UL))
#define bM0P_TIMER4_OCMR0_OCMR1                         *((volatile unsigned int*)(0x42400484UL))
#define bM0P_TIMER4_OCMR0_OCMR2                         *((volatile unsigned int*)(0x42400488UL))
#define bM0P_TIMER4_OCMR0_OCMR3                         *((volatile unsigned int*)(0x4240048CUL))
#define bM0P_TIMER4_OCMR0_OCMR4                         *((volatile unsigned int*)(0x42400490UL))
#define bM0P_TIMER4_OCMR0_OCMR5                         *((volatile unsigned int*)(0x42400494UL))
#define bM0P_TIMER4_OCMR0_OCMR6                         *((volatile unsigned int*)(0x42400498UL))
#define bM0P_TIMER4_OCMR0_OCMR7                         *((volatile unsigned int*)(0x4240049CUL))
#define bM0P_TIMER4_OCMR0_OCMR8                         *((volatile unsigned int*)(0x424004A0UL))
#define bM0P_TIMER4_OCMR0_OCMR9                         *((volatile unsigned int*)(0x424004A4UL))
#define bM0P_TIMER4_OCMR0_OCMR10                        *((volatile unsigned int*)(0x424004A8UL))
#define bM0P_TIMER4_OCMR0_OCMR11                        *((volatile unsigned int*)(0x424004ACUL))
#define bM0P_TIMER4_OCMR0_OCMR12                        *((volatile unsigned int*)(0x424004B0UL))
#define bM0P_TIMER4_OCMR0_OCMR13                        *((volatile unsigned int*)(0x424004B4UL))
#define bM0P_TIMER4_OCMR0_OCMR14                        *((volatile unsigned int*)(0x424004B8UL))
#define bM0P_TIMER4_OCMR0_OCMR15                        *((volatile unsigned int*)(0x424004BCUL))
#define bM0P_TIMER4_OCMR1_OCMR0                         *((volatile unsigned int*)(0x42400500UL))
#define bM0P_TIMER4_OCMR1_OCMR1                         *((volatile unsigned int*)(0x42400504UL))
#define bM0P_TIMER4_OCMR1_OCMR2                         *((volatile unsigned int*)(0x42400508UL))
#define bM0P_TIMER4_OCMR1_OCMR3                         *((volatile unsigned int*)(0x4240050CUL))
#define bM0P_TIMER4_OCMR1_OCMR4                         *((volatile unsigned int*)(0x42400510UL))
#define bM0P_TIMER4_OCMR1_OCMR5                         *((volatile unsigned int*)(0x42400514UL))
#define bM0P_TIMER4_OCMR1_OCMR6                         *((volatile unsigned int*)(0x42400518UL))
#define bM0P_TIMER4_OCMR1_OCMR7                         *((volatile unsigned int*)(0x4240051CUL))
#define bM0P_TIMER4_OCMR1_OCMR8                         *((volatile unsigned int*)(0x42400520UL))
#define bM0P_TIMER4_OCMR1_OCMR9                         *((volatile unsigned int*)(0x42400524UL))
#define bM0P_TIMER4_OCMR1_OCMR10                        *((volatile unsigned int*)(0x42400528UL))
#define bM0P_TIMER4_OCMR1_OCMR11                        *((volatile unsigned int*)(0x4240052CUL))
#define bM0P_TIMER4_OCMR1_OCMR12                        *((volatile unsigned int*)(0x42400530UL))
#define bM0P_TIMER4_OCMR1_OCMR13                        *((volatile unsigned int*)(0x42400534UL))
#define bM0P_TIMER4_OCMR1_OCMR14                        *((volatile unsigned int*)(0x42400538UL))
#define bM0P_TIMER4_OCMR1_OCMR15                        *((volatile unsigned int*)(0x4240053CUL))
#define bM0P_TIMER4_OCMR1_OCMR16                        *((volatile unsigned int*)(0x42400540UL))
#define bM0P_TIMER4_OCMR1_OCMR17                        *((volatile unsigned int*)(0x42400544UL))
#define bM0P_TIMER4_OCMR1_OCMR18                        *((volatile unsigned int*)(0x42400548UL))
#define bM0P_TIMER4_OCMR1_OCMR19                        *((volatile unsigned int*)(0x4240054CUL))
#define bM0P_TIMER4_OCMR1_OCMR20                        *((volatile unsigned int*)(0x42400550UL))
#define bM0P_TIMER4_OCMR1_OCMR21                        *((volatile unsigned int*)(0x42400554UL))
#define bM0P_TIMER4_OCMR1_OCMR22                        *((volatile unsigned int*)(0x42400558UL))
#define bM0P_TIMER4_OCMR1_OCMR23                        *((volatile unsigned int*)(0x4240055CUL))
#define bM0P_TIMER4_OCMR1_OCMR24                        *((volatile unsigned int*)(0x42400560UL))
#define bM0P_TIMER4_OCMR1_OCMR25                        *((volatile unsigned int*)(0x42400564UL))
#define bM0P_TIMER4_OCMR1_OCMR26                        *((volatile unsigned int*)(0x42400568UL))
#define bM0P_TIMER4_OCMR1_OCMR27                        *((volatile unsigned int*)(0x4240056CUL))
#define bM0P_TIMER4_OCMR1_OCMR28                        *((volatile unsigned int*)(0x42400570UL))
#define bM0P_TIMER4_OCMR1_OCMR29                        *((volatile unsigned int*)(0x42400574UL))
#define bM0P_TIMER4_OCMR1_OCMR30                        *((volatile unsigned int*)(0x42400578UL))
#define bM0P_TIMER4_OCMR1_OCMR31                        *((volatile unsigned int*)(0x4240057CUL))
#define bM0P_TIMER4_OCMR2_OCMR0                         *((volatile unsigned int*)(0x42400580UL))
#define bM0P_TIMER4_OCMR2_OCMR1                         *((volatile unsigned int*)(0x42400584UL))
#define bM0P_TIMER4_OCMR2_OCMR2                         *((volatile unsigned int*)(0x42400588UL))
#define bM0P_TIMER4_OCMR2_OCMR3                         *((volatile unsigned int*)(0x4240058CUL))
#define bM0P_TIMER4_OCMR2_OCMR4                         *((volatile unsigned int*)(0x42400590UL))
#define bM0P_TIMER4_OCMR2_OCMR5                         *((volatile unsigned int*)(0x42400594UL))
#define bM0P_TIMER4_OCMR2_OCMR6                         *((volatile unsigned int*)(0x42400598UL))
#define bM0P_TIMER4_OCMR2_OCMR7                         *((volatile unsigned int*)(0x4240059CUL))
#define bM0P_TIMER4_OCMR2_OCMR8                         *((volatile unsigned int*)(0x424005A0UL))
#define bM0P_TIMER4_OCMR2_OCMR9                         *((volatile unsigned int*)(0x424005A4UL))
#define bM0P_TIMER4_OCMR2_OCMR10                        *((volatile unsigned int*)(0x424005A8UL))
#define bM0P_TIMER4_OCMR2_OCMR11                        *((volatile unsigned int*)(0x424005ACUL))
#define bM0P_TIMER4_OCMR2_OCMR12                        *((volatile unsigned int*)(0x424005B0UL))
#define bM0P_TIMER4_OCMR2_OCMR13                        *((volatile unsigned int*)(0x424005B4UL))
#define bM0P_TIMER4_OCMR2_OCMR14                        *((volatile unsigned int*)(0x424005B8UL))
#define bM0P_TIMER4_OCMR2_OCMR15                        *((volatile unsigned int*)(0x424005BCUL))
#define bM0P_TIMER4_OCMR3_OCMR0                         *((volatile unsigned int*)(0x42400600UL))
#define bM0P_TIMER4_OCMR3_OCMR1                         *((volatile unsigned int*)(0x42400604UL))
#define bM0P_TIMER4_OCMR3_OCMR2                         *((volatile unsigned int*)(0x42400608UL))
#define bM0P_TIMER4_OCMR3_OCMR3                         *((volatile unsigned int*)(0x4240060CUL))
#define bM0P_TIMER4_OCMR3_OCMR4                         *((volatile unsigned int*)(0x42400610UL))
#define bM0P_TIMER4_OCMR3_OCMR5                         *((volatile unsigned int*)(0x42400614UL))
#define bM0P_TIMER4_OCMR3_OCMR6                         *((volatile unsigned int*)(0x42400618UL))
