MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32M140KA/mcu.h
#define bM0P_WSUNIT_BUR13_BUR137                        *((volatile unsigned int*)(0x426AE19CUL))
#define bM0P_WSUNIT_BUR14_BUR140                        *((volatile unsigned int*)(0x426AE1A0UL))
#define bM0P_WSUNIT_BUR14_BUR141                        *((volatile unsigned int*)(0x426AE1A4UL))
#define bM0P_WSUNIT_BUR14_BUR142                        *((volatile unsigned int*)(0x426AE1A8UL))
#define bM0P_WSUNIT_BUR14_BUR143                        *((volatile unsigned int*)(0x426AE1ACUL))
#define bM0P_WSUNIT_BUR14_BUR144                        *((volatile unsigned int*)(0x426AE1B0UL))
#define bM0P_WSUNIT_BUR14_BUR145                        *((volatile unsigned int*)(0x426AE1B4UL))
#define bM0P_WSUNIT_BUR14_BUR146                        *((volatile unsigned int*)(0x426AE1B8UL))
#define bM0P_WSUNIT_BUR14_BUR147                        *((volatile unsigned int*)(0x426AE1BCUL))
#define bM0P_WSUNIT_BUR15_BUR150                        *((volatile unsigned int*)(0x426AE1C0UL))
#define bM0P_WSUNIT_BUR15_BUR151                        *((volatile unsigned int*)(0x426AE1C4UL))
#define bM0P_WSUNIT_BUR15_BUR152                        *((volatile unsigned int*)(0x426AE1C8UL))
#define bM0P_WSUNIT_BUR15_BUR153                        *((volatile unsigned int*)(0x426AE1CCUL))
#define bM0P_WSUNIT_BUR15_BUR154                        *((volatile unsigned int*)(0x426AE1D0UL))
#define bM0P_WSUNIT_BUR15_BUR155                        *((volatile unsigned int*)(0x426AE1D4UL))
#define bM0P_WSUNIT_BUR15_BUR156                        *((volatile unsigned int*)(0x426AE1D8UL))
#define bM0P_WSUNIT_BUR15_BUR157                        *((volatile unsigned int*)(0x426AE1DCUL))
#define bM0P_WSUNIT_BUR16_BUR160                        *((volatile unsigned int*)(0x426AE1E0UL))
#define bM0P_WSUNIT_BUR16_BUR161                        *((volatile unsigned int*)(0x426AE1E4UL))
#define bM0P_WSUNIT_BUR16_BUR162                        *((volatile unsigned int*)(0x426AE1E8UL))
#define bM0P_WSUNIT_BUR16_BUR163                        *((volatile unsigned int*)(0x426AE1ECUL))
#define bM0P_WSUNIT_BUR16_BUR164                        *((volatile unsigned int*)(0x426AE1F0UL))
#define bM0P_WSUNIT_BUR16_BUR165                        *((volatile unsigned int*)(0x426AE1F4UL))
#define bM0P_WSUNIT_BUR16_BUR166                        *((volatile unsigned int*)(0x426AE1F8UL))
#define bM0P_WSUNIT_BUR16_BUR167                        *((volatile unsigned int*)(0x426AE1FCUL))


#ifdef __cplusplus
}
#endif

#endif /* __HC32M140KX_H__ */

